# Лабораторная работа №7 Синхронизация потоков с помощью мьютексов

**Цель работы**: Научиться организовывать синхронизацию нескольких параллельно выполняющихся процессов или 
потоков используя мьютексы.

## Задание

Данная работа предполагает решение задачи организации взаимоисключающего доступа к разделяемому ресурсу с помощью
мьютексов.

**Вариант №6**: Напишите программу, в которой два потока работая параллельно, генерируют в цикле (100 итераций) 
некоторую последовательность целых чисел. Полученные данные накапливаются в общем массиве размером 10 элементов.
Причём, в один и тот же момент времени в массиве могут находиться данные, принадлежащие одному потоку. Всякий 
раз, после заполнения массива, поток, чьи данные в нем находятся, должен выгрузить содержимое массива в общий 
текстовый файл и очистить массив.

## Теоретическая часть

Мьютексы позволяют организовать взаимоисключающий доступ к единому разделяемому ресурсу. Если один поток захватил 
мьютекс, то любой другой поток, который пытается захватить мьютекс будет приостановлен до тех пор, пока первый 
поток его не освободит. В .NET работа с мьютексами реализована через класс `System.Treading.Mutex`. Для захвата 
мьютекса используется метод `WaitOne()`. Поток владеющий мьютексом должен освободить его вызовом метода 
`ReleaseMutex()`. Мьютекс может быть освобождён только тем потоком, который его захватил.

Если поток завершился не освободив мьютекс, то он будет считаться брошенным. Брошенный мьютекс является свободным,
но при его захвате другим потоком будет выброшено исключение `System.Threading.AbandonedMutexException`.

Виды мьютексов:
- Локальные (анонимные) - можно использовать только внутри одного процесса, но любым его потоком имеющим к нему 
доступ;
- Именованные - доступны в пределах всех приложений запущенных на данном компьютере и позволяют синхронизировать 
процессы.

Метод `OpenExisting(string name)` позволяет создать несколько экземпляров и открыть существующий мьютекс. 

Пример, реализации взаимоисключающего доступа к файлу с помощью мьютекс:

```csharp
class Program
{
    public static Random random = new();
    public static Mutex mutex = new();
    public static Thread firstThread, secondThread;

    public static void Main(string[] args)
    {
        firstThread = new Thread(ThreadMethod) { Name = "First thread" };
        secondThread = new Thread(ThreadMethod) { Name = "Second thread" };

        firstThread.Start();
        secondThread.Start();

        Console.ReadKey();
    }

    public static void Do(string text)
    {
        Thread.Sleep(random.Next(100));
        mutex.WaitOne();

        File.AppendAllText(Environment.GetFolderPath(Environment.SpecialFolder.UserProfile) + @"\Downloads\data.txt", text);
        Console.WriteLine(text);

        Thread.Sleep(random.Next(100));
        mutex.ReleaseMutex();
    }

    public static void ThreadMethod() => Do(Thread.CurrentThread.Name ?? "No name");
}
```